[
    {
        "subject": "PSYCH",
        "course_number": "104",
        "course_title": "- Basic Psychological Processes",
        "credits": "3 units (fi 6)(EITHER, 3-0-1/4)",
        "description": "Principles and development of perception, motivation, learning, and thinking and their relationship to the psychological functioning of the individual. Fulfillment of the 1/4 laboratory credit typically entails serving as a research participant, but can be fulfilled through the completion of alternative assignments. Note: PSYCH 104 is not a prerequisite for PSYCH 105. PSYCH 104 and 105 can be taken in either term, but not in the same term. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "105",
        "course_title": "- Individual and Social Behavior",
        "credits": "3 units (fi 6)(EITHER, 3-0-1/4)",
        "description": "Introduction to the study of human individuality, personality, and social psychological processes. Some aspects of normal and abnormal human development, psychological assessment and treatment may be reviewed. Fulfillment of the 1/4 laboratory credit typically entails serving as a research participant but can be fulfilled through the completion of alternative assignments. Note: PSYCH 104 and 105 can be taken in either term, but not in the same term. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "212",
        "course_title": "- Introduction to Research Methods in Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Experimental and nonexperimental methods in psychology. Topics covered include philosophy of science, measurement, reliability and validity of methods, measures, and effects; experimental quasi-experimental, and single-subject designs; biases in experimentation; and research ethics. Prerequisites: PSYCH 104 or SCI 100, or PSYCH 105. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "213",
        "course_title": "- Introduction to Data Analysis in Psychology I",
        "credits": "3 units (fi 6)(EITHER, 3-0-1)",
        "description": "Introduces basic analytical concepts and methods used in conducting and interpreting psychological research. Students will begin to learn how to summarize, interpret, and draw inferences from psychological data. This course covers quantitative and qualitative forms of data and data management; explores fundamental principles used in psychometric, neuroscientific, and behavioural analyses; and examines analytical techniques necessary for assessing frequency, associative, and causal claims. Fulfillment of the 1 hour lab component typically involves the completion of analysis assignments. Prerequisites: PSYCH 104 or PSYCH 105. [Faculty of Science] Note: This course may not be taken for credit if credit has been obtained in STAT 151 or 161, KIN 109, PEDS 109, PTHER 352, or SOC 210."
    },
    {
        "subject": "PSYCH",
        "course_number": "223",
        "course_title": "- Lifespan Developmental Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Introduction to biological, cognitive and social aspects of psychological development. Prerequisite: PSYCH 105. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "239",
        "course_title": "- Abnormal Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Nature and treatment of psychological disorders, such as cross-disciplinary perspectives and an emphasis on improving understanding of psychopathology in everyday life. Prerequisite: PSYCH 105. Not open to students with credit in PSYCH 339. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "241",
        "course_title": "- Social Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "A survey of theories and research on the individual in a social context. Prerequisite: PSYCH 105. Note: PSYCH 241 and SOC 241 may not both be taken for credit. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "258",
        "course_title": "- Cognitive Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "A survey of findings of theoretical issues in the study of cognition, such as perception, attention, knowledge representation, memory, learning, language, reasoning, and problem solving. Prerequisites: PSYCH 104 or SCI 100. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "275",
        "course_title": "- Brain and Behavior",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An introduction to brain mechanisms involved in sensation, perception, movement, motivation, learning, and cognition, as studied in both humans and lower animals. Prerequisites: PSYCH 104 or SCI 100. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "282",
        "course_title": "- Behavior Modification",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "A study of applications of learning principles and laboratory findings to behavior problems in educational, clinical, and social settings, with emphasis on empirical research demonstrating the effectiveness of behavior modification and cognitive/behavioral techniques. Not open to students with credit in PSYCH 281. Prerequisites: PSYCH 104 or SCI 100. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "299",
        "course_title": "- Research Opportunity Program in Psychology",
        "credits": "1.5 units (fi 3)(EITHER, 0-0-3)",
        "description": "A credit/no-credit course for supervised participation in a faculty research project. Normally taken after completion of a minimum of 30 units but not more than 60 units. Prerequisites: GPA of 2.5 or higher, PSYCH 104 or SCI 100 and one other PSYCH course; and consent of Department. Specific projects may require additional prerequisites. Project and course information available at ROPP website or Department of Psychology. Prospective enrollees in PSYCH 299 must apply to the Department of Psychology. Note: Application does not guarantee an ROPP position. Credit may be obtained twice. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "300",
        "course_title": "- Honors Seminar I",
        "credits": "3 units (fi 6)(VAR, 3-0-0)",
        "description": "A range of conceptual and methodological issues in psychology are considered, and students receive intensive training and practice in both written and oral communications. Restricted to, and required of, third-year students in the Arts Honors Psychology program. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "302",
        "course_title": "- Special Topics in Psychological Research",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Review and discussion of special topics or methods in one or more of the areas of contemporary psychology such as experimental, perception, physiological, learning, memory, behavior, quantitative. Prerequisites: PSYCH 104 or SCI 100 and PSYCH 105 and one 200-level Psychology course. Students must check with the Department for the topics for the year and any additional prerequisites. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "303",
        "course_title": "- History of Ideas in Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Psychological ideas from ancient times to the beginning of cognitive science in the mid 20th century. Prerequisite: one 200-level PSYCH offered by the Faculty of Arts; one 200-level PSYCH offered by the Faculty of Science. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "304",
        "course_title": "- History of Modern Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An overview of the scientific discipline of psychology since the mid- 20th century. Prerequisites: one 200-level PSYCH offered by the Faculty of Arts; one 200- level PSYCH offered by the Faculty of Science. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "305",
        "course_title": "- Special Topics in Psychology I",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Review and discussion of special topics or methods in one or more of the areas of contemporary psychology such as developmental, social, personality, cognitive. Prerequisites: PSYCH 104 or SCI 100, PSYCH 105 and a 200-level PSYCH class. Note: Consult the Department of Psychology's website for the specific topic(s) offered each year and any additional prerequisites. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "309",
        "course_title": "- Honors Seminar I",
        "credits": "3 units (fi 6)(VAR, 3-0-0)",
        "description": "A range of conceptual and methodological issues in psychology are considered, and students receive intensive training and practice in both written and oral communications. Pre-requisite: A committed Thesis Supervisor and approval of the Psychology Honors Advisors. Restricted to, and required of, students in their first year in the Science Honors Psychology program. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "310",
        "course_title": "- Foundations in Professional Competencies",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "This course is a practical competencies development course open to all students interested in acquiring skills relevant to the workplace. The course focuses on professional development, including skills in written and verbal communication and the ability to make contributions in a team environment. The emphasis is on hands-on practice of skills considered applicable after graduation. Prerequisites: PSYCH 104, PSYCH 105, and a 200-level PSYCH class. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "313",
        "course_title": "- Introduction to Data Analysis in Psychology II",
        "credits": "3 units (fi 6)(EITHER, 3-0-3)",
        "description": "This course is a continuation of PSYCH 213. Reviews basic analytical concepts and methods used in conducting and interpreting psychological research, and introduces more advanced methods and analyses that are commonly used in psychological research. Students will learn how to use software to analyze, interpret, and draw inferences from psychological data. Fulfillment of the 3 hour lab component typically involves the completion of analysis assignments. Prerequisites: PSYCH 212, and PSYCH 213 or STAT 151 or 161. [Faculty of Science] Note: This course may not be taken for credit if credit has been obtained in STAT 252."
    },
    {
        "subject": "PSYCH",
        "course_number": "315",
        "course_title": "- Introduction to Qualitative Methods in Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-3)",
        "description": "Introduces basic concepts, assumptions and methods used in conducting and interpreting qualitative research in Psychology. Students will be introduced to qualitative forms of data and data management; assumptions and principles that inform qualitative research; and procedures for gathering meaningful qualitative data and analyzing and interpreting these data. Fulfillment of the 3 hour lab component typically involves the completion of assignments. Prerequisites: PSYCH 212 and, PSYCH 213 or STAT 151 or STAT 161. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "323",
        "course_title": "- Infant and Child Development",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Biological, cognitive and social aspects of psychological development during the period from infancy to childhood. Prerequisite: PSYCH 223. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "325",
        "course_title": "- Applied Research in Developmental Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Integration of developmental theories and research with an emphasis on practical approaches to support healthy development. Students volunteer with a local agency to work with infants, children, or adolescents. May be offered as a Community-Service Learning course. Prerequisite: PSYCH 223. [Faculty of Arts]."
    },
    {
        "subject": "PSYCH",
        "course_number": "327",
        "course_title": "- Adolescent Development",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Biological, cognitive, and social aspects of development that occur during the period from early to late adolescence.  Prerequisite: PSYCH 223. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "329",
        "course_title": "- Adult Development and Aging",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Overview of physical, psychological, and sociocultural realities of aging. This course may be offered as a Community Service-Learning course. Prerequisite: PSYCH 223. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "333",
        "course_title": "- Personality Theory",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An in-depth treatment of psychological theories of personality. Prerequisites: PSYCH 223, 239, or 241. Note: Not open to students with credit in PSYCH 233 or PSYCH 305 Topic: Personality. [Faculty of Arts]."
    },
    {
        "subject": "PSYCH",
        "course_number": "335",
        "course_title": "- Introduction to Clinical Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "The study of the profession of clinical psychology, including topics such as case studies to examine diagnosis and assessment, judgement and decision making, and psychotherapeutic and community interventions. Prerequisite: PSYCH 239. Not open to students with credit in PSYCH 435. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "341",
        "course_title": "- Cultural Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Study of cultural variations in psychological processes such as self-perception, cognition, emotion, and motivation. The course also introduces the issues of cultural evolution and multiculturalism. Prerequisites: one of PSYCH 223, 241, or 258. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "342",
        "course_title": "- Social Influence",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Introduction to research on social influence, including theory and empirical research on conformity, compliance, and obedience. Prerequisites: PSYCH 241 or SOC 241. Note: Not open to students with credit in PSYCH 305 Topic: Social Influence. [Faculty of Arts]."
    },
    {
        "subject": "PSYCH",
        "course_number": "344",
        "course_title": "- Intercultural Communication",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Review of theory and research on communication processes in intercultural social interactions. Prerequisites: PSYCH 105. Note: Not open to students with previous credit in PSYCH 405 Topic: Intercultural Communications [Faculty of Arts]."
    },
    {
        "subject": "PSYCH",
        "course_number": "347",
        "course_title": "- Interpersonal Relationships",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "A general overview of research and theory in the domain of relationships, based on classic and contemporary findings from the social psychological literature. Most of the course content will focus on adult romantic relationships. Prerequisites: PSYCH 241 or SOC 241. Note: Not open to students with credit in HECOL 210 or PSYCH 305 Topic: Interpersonal Relationships. [Faculty of Arts]."
    },
    {
        "subject": "PSYCH",
        "course_number": "348",
        "course_title": "- Organizational Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "This course focuses on the scientific study of human behavior in organizations and the work place. This course examines individual, group and organizational behavior and applies this knowledge to solve problems in the workplace. Note: Not open to students with credit in PSYCH 305 Topic: Organizational Psychology. Prerequisites: PSYCH 104, PSYCH 105, and PSYCH 241 or SOC 241. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "349",
        "course_title": "- Theories of Leadership",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "This course provides an in-depth examination of research and theory related to the scientific study of leadership. Note: Not open to students with credit in PSYCH 302 Topic: Theories of Leadership. Prerequisites: PSYCH 104, PSYCH 105, and PSYCH 241 or SOC 241. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "350",
        "course_title": "- Human Memory",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An introduction to the study of human memory. Topics include verbal learning and interference theory, the short-term/long-term memory distinction, semantic memory, working memory, sensory memory, autobiographical memory, amnesia, and implicit memory. The emphasis will be on developing coherent theoretical accounts of the evidence. Prerequisite: PSYCH 258. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "351",
        "course_title": "- Spatial Cognition",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "This course will survey research on how people learn and remember spatial information, and navigate their environments. Topics may include neurology, individual differences, cultural and cross-species comparisons. Prerequisites: One of: PSYCH 258, 267 or 275. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "353",
        "course_title": "- The Psychology of Board Games",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "The Psychology of Board Games offers an integrative review of the multiple intersections between board games and Psychology. Students will think critically about board games through the lens of science, draw specific connections between games and Cognitive Psychology, and apply a scientific approach in designing games and game components. Note: Not open to students with credit in PSYCH 302 or 305 Topic: The Psychology of Board Games. Prerequisites: PSYCH 104, PSYCH 105, and one 200-level PSYCH course. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "354",
        "course_title": "- Foundations of Cognitive Science",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An introduction to the theories and research practices of cognitive science by examining contributions of cognitive psychology, artificial intelligence, linguistics, and neuroscience to a variety of research areas. Prerequisites: PSYCH 213 or STAT 151 or 161, and PSYCH 258. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "356",
        "course_title": "- Research Methods in Cognition",
        "credits": "3 units (fi 6)(EITHER, 3-0-3)",
        "description": "A detailed examination of some of the common methods used for investigating cognitive processes. Topics include response time methods, priming paradigms, tachistoscopic presentation techniques, reading time measurement, and the use of recognition and recall tests. The focus of the course will be on the application of these methods to current theories and issues in cognitive psychology. Laboratories will provide students with first-hand experience at applying these methods to research problems. Prerequisite: PSYCH 258. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "357",
        "course_title": "- Language Processing",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "A survey of theories and research on the production and comprehension of spoken and written language. Topics include speech perception, printed word recognition, sentence production and comprehension, discourse processing, reading, language development, and language pathologies. The focus will be on the processing mechanisms implicated by findings in the area. Prerequisite: PSYCH 258. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "358",
        "course_title": "- Applied Cognitive Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Overview of a number of topics in the area of Applied Cognitive Psychology and methodologies used to investigate complex real-world problems. Note: Not open to students with credit in PSYCH 405 Topic: Applied Cognitive Psychology. Prerequisites: PSYCH 213 or STAT 151 or STAT 161, and PSYCH 258. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "367",
        "course_title": "- Perception",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An introduction to theoretical and experimental issues associated with sensory and perceptual experience. Prerequisites: PSYCH 275 or 258. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "371",
        "course_title": "- The Neurobiology of Learning and Memory",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "The aim of this course is to provide students with an introduction to the neural basis of learning and memory. The course begins with a review of the historical background, experimental methods, and principles of neurobiology. Learning and memory are then analyzed at different levels of biological organization, including molecular, cellular, neural circuit, neural system, and behavioral levels. Prerequisite: PSYCH 275. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "372",
        "course_title": "- Behavior in Relation to Genetics",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An examination of the influence of genetic variations on behavioral differences in infra-human and human populations. Prerequisites: PSYCH 104, PSYCH 213 or STAT 151 or 161, and BIOL 207. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "374",
        "course_title": "- Psychopharmacology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Examines psychopharmacology of drug abuse, with a focus on drug administration, neurotransmitter systems, and drug actions in the context of commonly used drugs such as alcohol, cannabis, psychedelics, and opioids. Topics span general synaptic transmission, methods, mechanisms of action, and theories of addiction. Note: Not open to students with credit in PMCOL 305 or PSYCH 302 or 403 Topic: Psychopharmacology. Prerequisites: PSYCH 213 or STAT 151 or 161 and PSYCH 275. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "375",
        "course_title": "- Introduction to Cognitive Neuroscience",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Brain basis of human cognition studied using a diverse range of techniques, with a focus on measures of brain activity such as functional neuroimaging and electrophysiology and on experimental findings in neurologically intact participants. Topics include perception, motor control, attention, memory, language, emotion, and development/aging. Prerequisite: PSYCH 275."
    },
    {
        "subject": "PSYCH",
        "course_number": "377",
        "course_title": "- Human Neuropsychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Brain basis of cognition viewed through the lens of patients with brain damage. Topics include mood, motivation, perception, motor control, attention, memory, language, assessment and rehabilitation. Prerequisite: PSYCH 275. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "381",
        "course_title": "- Principles of Learning",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Principles and processes of learning including a consideration of classical conditioning, instrumental learning, and memory. Research involving non-human animals will be emphasized. Prerequisites: PSYCH 213 or STAT 151 or 161, and PSYCH 282. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "390",
        "course_title": "- Honors Thesis I: Research Apprenticeship",
        "credits": "3 units (fi 6)(VAR, 0-0-6)",
        "description": "Under the direction of a Faculty member, students pursue a topic of interest leading to the development of a thesis proposal (the proposed research is completed in PSYCH 499). The work normally involves both directed readings and empirical research experience. Note: Must be taken twice in the first year in the Honors program. In the first year in the Honors Program students must complete a formal presentation (i.e., oral or poster) about their research progress. This is typically done at the annual Honors Psychology Conference. Other public venues can fulfill this requirement, with approval by the Honors advisor. Prerequisite: A committed Thesis Supervisor. Restricted to, and required of, students in their first year in the Science Honors Psychology program. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "391",
        "course_title": "- Evolutionary Theory in Psychology",
        "credits": "3 units (fi 6)(FIRST, 3-0-0)",
        "description": "An introduction to evolutionary psychology; the course will examine the application of evolutionary theory to the field of psychology. Prerequisites: two 200-level PSYCH courses."
    },
    {
        "subject": "PSYCH",
        "course_number": "396",
        "course_title": "- Individual Research",
        "credits": "3 units (fi 6)(EITHER, 0-3S-3)",
        "description": "A course designed to allow the senior undergraduate student the opportunity to pursue a supervised research project in greater depth than the classroom structure permits. Directed research done under the supervision of an academic member of the Psychology Department. Successful completion of this course requires a formal research proposal or report, lab notes, and/or essay. Normally for students in their third year of study. Cannot be taken more than twice. Prerequisites: a 200-level PSYCH course and consent of the Department. Specific projects may require additional prerequisites. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "398",
        "course_title": "- Individual Study I",
        "credits": "3 units (fi 6)(EITHER, 0-3S-3)",
        "description": "A course designed to allow the senior undergraduate student the opportunity to pursue a supervised research project in greater depth than the classroom structure permits. Directed research done under the supervision of an academic member of the Psychology Department. Successful completion of this course requires a formal research proposal or report, lab notes, and/or essay. Normally for students in their third year of study. Cannot be taken more than twice. Prerequisite: a 200-level PSYCH course and consent of the Department. Specific projects may require additional prerequisites. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "399",
        "course_title": "- Honors Thesis I: Research Apprenticeship",
        "credits": "3 units (fi 6)(VAR, 0-0-6)",
        "description": "Under the direction of a Faculty member, students pursue a topic of interest leading to the development of a thesis proposal and, during their fourth year, the thesis research. The work normally involves both directed readings and empirical research experience. Restricted to, and required of, third-year students in the Arts Honors Psychology program. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "400",
        "course_title": "- Honors Seminar II",
        "credits": "3 units (fi 6)(VAR, 3-0-0)",
        "description": "A continuation of PSYCH 300, with an emphasis on the development of professional skills. Topics include the new information technologies, the publication process, ethical issues, and the application of research findings to real-world problems. Prerequisite: PSYCH 300. Restricted to, and required of, fourth-year students in the Arts Honors Psychology program. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "403",
        "course_title": "- Recent Advances in Experimental Psychology: Models and Theories",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Discussion of advanced concepts and theories developed by selected fields within experimental psychology. The course will examine the relation between theory and data in these fields. Prerequisites: PSYCH 213 or STAT 151 or 161, and a 300-level PSYCH course. Note: Consult the Department of Psychology webpage for the topics for the year and any additional prerequisites (https://www.ualberta.ca/psychology/undergraduate-studies/courses/special-topics.html). [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "405",
        "course_title": "- Special Topics in Psychology II",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Review and discussion of special theoretical or methodological topics, or a novel or emerging research areas in contemporary psychology. Prerequisites: PSYCH 104, PSYCH 105, PSYCH 213 or STAT 151 or 161, and a 300-level PSYCH course. Note: Consult the Department of Psychology webpage for the topics for the year and any additional prerequisites. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "409",
        "course_title": "- Honors Seminar II",
        "credits": "3 units (fi 6)(VAR, 3-0-0)",
        "description": "A continuation of PSYCH 309, with an emphasis on the development of professional skills. Topics include the new information technologies, the publication process, ethical issues, and the application of research findings to real-world problems. Prerequisite: PSYCH 309 and a committed Thesis Supervisor and approval of the Psychology Honors Advisor. Restricted to, and required of, students in their second year in the Science Honors Psychology program. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "413",
        "course_title": "- Design and Analysis of Experiments in Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-3)",
        "description": "Provides the background necessary to design and analyze data in any area of experimental psychology and prepares students to conduct original research. Topics include sampling distributions and hypothesis testing; issues in and analysis of between-subjects, within-subjects, and mixed designs; trend analysis; planned and post hoc comparisons; fixed and random effects factors; and efficiency and power of various experimental designs. Prerequisite: PSYCH 212, PSYCH 213 or STAT 151 or 161, and PSYCH 313 or STAT 252 or permission of the department. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "415",
        "course_title": "- Qualitative Methods in Sociocultural Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-2)",
        "description": "The assumptions that inform the design of qualitative research in sociocultural psychology; the procedures for gathering meaningful information through interviews, conversation, observed interaction, and textual archives; and the analysis of such information. Prerequisites: PSYCH 212, PSYCH 213 or STAT 151 or 161, and one of PSYCH 223, 239, 241, or 341. [Faculty of Arts]."
    },
    {
        "subject": "PSYCH",
        "course_number": "421",
        "course_title": "- Advanced Topics in Human Development",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An in-depth review and analysis of research in an area of human development. Prerequisites: PSYCH 213 or STAT 151 or 161, and PSYCH 323 or 327 or 329. Note: Consult the Department of Psychology website for the specific topic offered each year and any additional prerequisites (https://www.ualberta.ca/psychology/undergraduate-studies/courses/special-topics.html). [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "423",
        "course_title": "- Advanced Topics in Developmental Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An in-depth review and analysis of research in an area of developmental psychology. Prerequisites: PSYCH 213 or STAT 151 or 161, and PSYCH 323 or PSYCH 327 or 329. Note: Consult with the Department for the specific topic offered each year and any additional prerequisites. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "425",
        "course_title": "- Developmental Cognitive Neuroscience",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An in-depth review and analysis of developmental cognitive neuroscience methods and principles of brain development and neuroplasticity, and their application to particular domains of development (e.g., attention, language, emotion). Prerequisites: PSYCH 212, PSYCH 213 or STAT 151 or 161, and PSYCH 323 or 327 or 329 or 371 or 375 or 377. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "427",
        "course_title": "- Developmental Psychopathology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "This course provides an introduction to and overview of the field of Developmental Psychopathology and its contributions to understanding of adaptation and maladaptation in human development. Major theoretical and methodological concepts, key topics, and implications for applied developmental research are examined. Note: Not open to students with credit in PSYCH 423 Topic: Developmental Psychopathology. Prerequisites: PSYCH 213 or STAT 151 or STAT 161, and one of PSYCH 323, 325, 327, 329 or 335. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "431",
        "course_title": "- Theory and Practice of Psychometrics",
        "credits": "3 units (fi 6)(EITHER, 3-0-3)",
        "description": "The nature of psychological tests: some practical work in administration, scoring and interpretation of tests. Prerequisites: PSYCH 213 or STAT 151 or 161, and PSYCH 333 or 335. [Faculty of Arts]."
    },
    {
        "subject": "PSYCH",
        "course_number": "432",
        "course_title": "- Psychological Studies of Dreaming",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An overview of dream studies, including the psychology of dreaming, dreaming and cognition, personality and dreaming, therapeutic dream use, and dreams in art and culture. Prerequisite: one of PSYCH 223, 233, 241, 333, or 341. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "436",
        "course_title": "- Psychology of Self-Estrangement",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Basic description of self-deception and self-estrangement in psychoanalytic and existential humanistic theories. Discussion of basic determinants of self-deception and, alternatively, self-awareness, as well as considerations of the methods of inquiry appropriate to the area. Prerequisite: One of PSYCH 223, 233, 241, 333, or 341. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "440",
        "course_title": "- Advanced Topics in Culture and Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Prerequisites: PSYCH 341 or PSYCH 343 [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "441",
        "course_title": "- Advanced Cultural Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "In-depth review of the theoretical and methodological bases of cultural psychology, with a focus on specific topics or issues in cultural psychology. Prerequisite: one of PSYCH 341, 342, 343, 344, or 347. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "443",
        "course_title": "- Social Cognition",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Advanced treatment of topics in the study of how we think about the world of persons and events. Topics may include the role of categories, schemas, theories, and heuristics in social cognition, factors underlying the stereotyping of persons and groups, and the question of motivated bias in social perception. Prerequisites: PSYCH 213 or STAT 151 or 161 and PSYCH 241. [Faculty of Arts]."
    },
    {
        "subject": "PSYCH",
        "course_number": "445",
        "course_title": "- Social Psychology and Cinema",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "The purpose of this course is to use a combination of social psychological theory, research and feature length films to explore the psychological determinants of important forms of human social behavior. Topics include the existential realities of the human condition, aggression, obedience, prejudice, attraction, and relationships. Prerequisites: One of PSYCH 212 or PSYCH 213 or STAT 151 or 161, and one of PSYCH 333, 342, 343, or 347. PSYCH 212 is strongly recommended. Note: Not open to students with credit in PSYCH 405 Topic: Studies of Self Through Cinema. [Faculty of Arts]."
    },
    {
        "subject": "PSYCH",
        "course_number": "447",
        "course_title": "- Self and Identity",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Review of theory and research on the self, primarily from a social psychological perspective. Prerequisites: One of PSYCH 212 or PSYCH 213 or STAT 151 or 161, and one of PSYCH 342 or PSYCH 347. PSYCH 212 is strongly recommended. Note: Not open to students with credit in PSYCH 405 Topic: Self and Identity. [Faculty of Arts]."
    },
    {
        "subject": "PSYCH",
        "course_number": "448",
        "course_title": "- Group Processes and Intergroup Relations",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "In-depth examination of research and theory related to the social psychological processes within and between groups. Topics covered may include the importance of groups and group membership(s), social influence, group polarization, leadership, teams and teamwork, discrimination, collective action, and intergroup conflict and cooperation. Note: Not open to students with credit in PSYCH 405 Topic: Group Processes and Intergroup Relations. Prerequisites: PSYCH 213 or STAT 151 or STAT 161, and one 300-level PSYCH course. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "449",
        "course_title": "- Psychology of Teaching and Learning",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "This course examines what research in psychology and education can tell us about how learning in university takes place, and how this knowledge can be applied to the teaching and learning in undergraduate psychology courses. The practical component of this course involves students acting as undergraduate learning assistants (ULAs) to lead workshops or facilitate class activities in real undergraduate courses. Note: Not open to students with credit in PSYCH 405 Topic: Psychology of Teaching and Learning. Prerequisites: PSYCH 213 or STAT 151 or STAT 161, one 300-level PSYCH course, and a 3.0 GPA on all attempted PSYCH courses (excluding PSYCH 104 and 105). [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "452",
        "course_title": "- Minds and Machines",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Computational models are playing an increasingly important role in cognitive psychology. The purpose of this course is to provide students with the theoretical background for using such models, as well as some hands-on experience. Students will learn about the history of these models in cognitive psychology, how one might characterize good and bad models, and how cognitive psychologists attempt to experimentally validate their models. Prerequisite: PSYCH 354. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "453",
        "course_title": "- Social Neuroscience",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Survey of theories and research on social neuroscience. This course examines current theory and research on social neuroscience, principles of social neuroscience in everyday life, and causes and mechanisms of social behaviour from a neuroscientific perspective. Note: Not open to students with credit in PSYCH 403 Topic: Social Neuroscience. Prerequisites: PSYCH 213 or STAT 151 or 161, and one 300-level PSYCH course. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "454",
        "course_title": "- Cognitive Neuroscience of Attention",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Examination of the history of attention research, contemporary theories of attention, aspects of attention, methods used to study attention, dysfunctions of attention, the development of attention, and links between attention and other cognitive processes, such as memory and consciousness. Note: Not open to students with credit in PSYCH 403 Topic: Cognitive Neuroscience of Attention. Prerequisites: PSYCH 213 or STAT 151 or 161, and one 300-level PSYCH course. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "455",
        "course_title": "- Speech Perception",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Overview of the historical development and current issues in the investigation of speech perception. Prerequisite: PSYCH 357 or LING 205. Note: Not open to students with credit in PSYCH 405 Topic: Speech Perception or LING 455. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "457",
        "course_title": "- Embodied Cognitive Science",
        "credits": "3 units (fi 6)(EITHER, 0-3S-0)",
        "description": "Introduction to theory and practice of embodied cognitive science, focusing on phenomena that emerge from agent-environment, including how even simple agents can produce apparently complex behavior. Prerequisites: PSYCH 213 or STAT 151 or 161, PSYCH 354, and a 300-level psychology course. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "458",
        "course_title": "- Advanced Topics in Cognition",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "In depth examination of one or more topics in cognitive psychology. Topics may include knowledge representation, visual cognition, memory, learning, decision making, language, reasoning and problem-solving. Prerequisites: one of PSYCH 350, 354, 356, 357, or 365. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "459",
        "course_title": "- Human Aging: Cognitive Processes",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "A survey of the sensory, perceptual, memory, and cognitive changes in normal aging. Topics may include the relationship of psychological, environmental, social and health factors to cognitive processes. Prerequisites: PSYCH 258 and a 300-level Psychology course. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "467",
        "course_title": "- Advanced Perception",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An intensive exploration of selected theoretical, empirical, and applied issues in vision science and perception. Considers philosophical, psychological, and neuroscientific perspectives. Explores the origin and current status of important areas within the study of perception, including visual perception, time perception, synesthesia, and the relationship between perception and art. Note: Not open to students with credit in PSYCH 403 Topic: Advanced Perception. Prerequisites: PSYCH 213 or STAT 151 or 161, and PSYCH 367. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "471",
        "course_title": "- Neurophysiology: Theory, Methods, and Analysis",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "A survey of theory, methods, and analysis of various neurophysiological techniques utilized in brain-behaviour research. The dynamics of in vivo recordings will be extensively covered. Prerequisites: One of PSYCH 371, 375, 377 or PMCOL 371. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "473",
        "course_title": "- Advanced Topics in Neuroscience",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Covers in depth examination of one or more topics in neuroscience. Prerequisite: Students must check with the Department website for the topics for the year and any additional prerequisites."
    },
    {
        "subject": "PSYCH",
        "course_number": "478",
        "course_title": "- Behavior and Brain Chemistry",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "The influence of environmental and genetic factors on the relationship between chemistry of the brain and the behavior of humans and animals. Prerequisite: PSYCH 371, 375, or 377. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "483",
        "course_title": "- Spatial Cognition and Navigation",
        "credits": "3 units (fi 6)(EITHER, 0-3S-0)",
        "description": "The course critically evaluates research and theory in spatial cognition and navigation. Topics may include research from: comparative cognition, developmental psychology, evolution and ecology, human cognition, neuroscience or artificial intelligence. Prerequisites: STAT 141 or 151 or SCI 151, and PSYCH 351 or 381. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "485",
        "course_title": "- Theory in Learning and Comparative Cognition",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "A theoretical analysis of topics such as Pavlovian conditioning, instrumental learning, working memory, timing, concept learning, and order and numerical competence. Also discussed will be the purposes and nature of theories and the historical development of theory in learning and comparative cognition. Prerequisite: PSYCH 381. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "486",
        "course_title": "- Animal Cognition",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Examination of how scientists (e.g., psychologists and behavioural ecologists) test animal cognition. Discussion of topics in animal cognition, with attention to methodology used in both the field and in controlled laboratory settings to examine the biological relevance/evolution and mechanisms that underpin cognitive abilities in non-human animals. Note: Not open to students with credit in PSYCH 403 Topic: Animal Cognition. Prerequisites: PSYCH 381. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "490",
        "course_title": "- Honors Thesis II: Thesis Research",
        "credits": "3 units (fi 6)(VAR, 0-0-6)",
        "description": "Under the direction of a faculty member, students conduct an empirical research project culminating in the Honors Thesis. Prerequisite: PSYCH 399. Restricted to, and required of, fourth-year students in the Arts Honors psychology program. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "490A",
        "course_title": "- Honors Thesis II: Thesis Research",
        "credits": "1.5 units (fi 6)(VAR, 0-0-6)",
        "description": "Under the direction of a faculty member, students conduct an empirical research project culminating in the Honors Thesis. Prerequisite: PSYCH 399. Restricted to, and required of, fourth-year students in the Arts Honors psychology program. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "490B",
        "course_title": "- Honors Thesis II: Thesis Research",
        "credits": "1.5 units (fi 6)(VAR, 0-0-6)",
        "description": "Under the direction of a faculty member, students conduct an empirical research project culminating in the Honors Thesis. Prerequisite: PSYCH 399. Restricted to, and required of, fourth-year students in the Arts Honors psychology program. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "491",
        "course_title": "- Topics in Evolutionary Theory in Psychology",
        "credits": "3 units (fi 6)(SECOND, 3-0-0)",
        "description": "An in-depth review and analysis of theory and research on specific advanced topics in the field of evolutionary psychology. Prerequisite: PSYCH 391."
    },
    {
        "subject": "PSYCH",
        "course_number": "494",
        "course_title": "- Human Factors and Ergonomics",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Scientific knowledge about human behaviours, abilities, limitations, and other characteristics applied to design and use are examined in a range of contexts, from the operation of everyday things to extraordinary systems failures. Prerequisites: A 300-level PSYCH course. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "495",
        "course_title": "- Psychology of Aesthetics",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "An introduction to the psychological analysis of response to art. Consideration is both theoretical and empirical. Illustrative materials are drawn from several arts, including painting, sculpture and literature. The contribution of aesthetic behavior to personality development is considered. Prerequisites: One of PSYCH 223, 239 or 241. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "496",
        "course_title": "- Individual Research",
        "credits": "3 units (fi 6)(EITHER, 0-3S-3)",
        "description": "A course designed to allow the senior undergraduate student the opportunity to pursue a research topic in greater depth than the classroom structure permits. This pursuit may take the form of directed reading, library research, and/or laboratory experience. A formal paper, research proposal, research report, annotated bibliography, lab notes, and/or essay is required. Cannot be taken more than twice. Prerequisite: A 300-level psychology course and consent of Department. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "498",
        "course_title": "- Individual Study II",
        "credits": "3 units (fi 6)(EITHER, 0-3S-3)",
        "description": "A course intended to allow the senior undergraduate student the opportunity to pursue a research topic in greater depth than the classroom structure permits. This pursuit may take the form of directed reading, library research, and/or laboratory experience. A formal paper, research proposal, research report, annotated bibliography, lab notes, and/or essay is required. Cannot be taken more than twice. Prerequisites: A 300-level psychology course and consent of Department. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "499",
        "course_title": "- Honors Thesis II: Thesis Research",
        "credits": "3 units (fi 6)(VAR, 0-0-6)",
        "description": "Under the direction of a faculty member, students conduct an empirical research project culminating in the Honors Thesis. Note: Must be taken twice in the second year in the Honors program. In the second year in the Honors Program students must formally present the results of their thesis research. This is typically done at the annual Honors Psychology Conference. Other public venues can fulfill this requirement, with approval by the Honors advisor. Prerequisite: PSYCH 390 and a committed Thesis Supervisor. Restricted to, and required of, students in their second year in the Science Honors Psychology program. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "499A",
        "course_title": "- Honors Thesis II: Thesis Research",
        "credits": "1.5 units (fi 6)(VAR, 0-0-6)",
        "description": "Under the direction of a faculty member, students conduct an empirical research project culminating in the Honors Thesis. Note: Must be taken twice in the second year in the Honors program. In the second year in the Honors Program students must formally present the results of their thesis research. This is typically done at the annual Honors Psychology Conference. Other public venues can fulfill this requirement, with approval by the Honors advisor. Prerequisite: PSYCH 390 and a committed Thesis Supervisor. Restricted to, and required of, students in their second year in the Science Honors Psychology program. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "499B",
        "course_title": "- Honors Thesis II: Thesis Research",
        "credits": "1.5 units (fi 6)(VAR, 0-0-6)",
        "description": "Under the direction of a faculty member, students conduct an empirical research project culminating in the Honors Thesis. Note: Must be taken twice in the second year in the Honors program. In the second year in the Honors Program students must formally present the results of their thesis research. This is typically done at the annual Honors Psychology Conference. Other public venues can fulfill this requirement, with approval by the Honors advisor. Prerequisite: PSYCH 390 and a committed Thesis Supervisor. Restricted to, and required of, students in their second year in the Science Honors Psychology program. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "502",
        "course_title": "- Professional and Ethical Issues",
        "credits": "2 units (fi 4)(EITHER, 3-0-0)",
        "description": "[Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "505",
        "course_title": "- Conference Course in Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-3)",
        "description": "[Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "521",
        "course_title": "- Developmental Concepts and Theories",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "[Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "522",
        "course_title": "- Developmental Methods: Design and Data",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "[Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "523",
        "course_title": "- Developmental Methods: Application",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Prerequisite: PSYCH 522 or permission of Instructor. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "531",
        "course_title": "- Design and Analysis in Psychological Research I",
        "credits": "3 units (fi 6)(FIRST, 3-0-1)",
        "description": "[Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "532",
        "course_title": "- Design and Analysis in Psychological Research II",
        "credits": "3 units (fi 6)(SECOND, 3-0-1)",
        "description": "Prerequisite: PSYCH 531 or equivalent. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "541",
        "course_title": "- Advanced Social and Cultural Psychology I",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "[Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "542",
        "course_title": "- Advanced Social and Cultural Psychology II",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "[Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "543",
        "course_title": "- Advanced Cultural Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "In-depth review of the theoretical and methodological bases of cultural psychology, with a focus on specific topics or issues in cultural psychology. Prerequisite: None. [Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "560",
        "course_title": "- Memory and Cognition",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "[Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "561",
        "course_title": "- Advanced Learning and Comparative Cognition",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "[Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "574A",
        "course_title": "- Advanced Topics in Neuroscience",
        "credits": "1.5 units (fi 6)(TWO TERM, 0-1.5S-0)",
        "description": "[Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "574B",
        "course_title": "- Advanced Topics in Neuroscience",
        "credits": "1.5 units (fi 6)(TWO TERM, 0-1.5S-0)",
        "description": "[Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "576",
        "course_title": "- Cognitive Neuroscience",
        "credits": "3 units (fi 6)(EITHER, 0-3S-0)",
        "description": "Prerequisite: consent of Department. [Faculty of Science]"
    },
    {
        "subject": "PSYCH",
        "course_number": "600",
        "course_title": "- Individual Studies",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "[Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "622",
        "course_title": "- Topics in Developmental Psychology",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "[Faculty of Arts]"
    },
    {
        "subject": "PSYCH",
        "course_number": "631",
        "course_title": "- Topics in Quantitative Methods",
        "credits": "3 units (fi 6)(EITHER, 3-0-0)",
        "description": "Prerequisite: PSYCH 532 or permission of Instructor. [Faculty of Science]"
    }
]